{
    "addtional_profile": "Additional info",
    "username": "Username",
    "name": "Name",
    "email": "Email",
    "dept": "Department",
    "major": "Major",
    "coll": "College",
    "change": "Change",
    "linux_info": "Linux account information",
    "linux_username": "Username",
    "not_assigned": "Not assigned",
    "vpn_info": "VPN information",
    "vpn_not_assigned": "QR code not generated",
    "privacy": "Privacy",
    "institute": "Institute",

    "dashboard": "Dashboard",
    "vpn": "VPN",
    "linux": "Linux",
    "id": "Username",
    "close": "Close",

    "notice": "Notice",
    "notice_detail": "Welcome to the IT service portal. If you have any problems with the service or would like to request additional services, please contact the administrator.",

    "service_log": "Service log (last 20)",
    "service": "Service",
    "log": "Log",
    "log_loading": "Loading logs...",
    "log_none": "No logs found.",

    "privacy_title": "Privacy Policy",
    "privacy_1": "This portal collects personal information to provide IT services.",
    "privacy_2": "The collected personal information is used only for the purpose of providing the service and will not be used for any other purpose or provided to third parties without your consent.",
    "privacy_3": "For more information on the collection and use of personal information, please refer to the <a href=\"/privacy\">Privacy Policy</a>.",

    "shortcuts": "Shortcuts",
    "freqeuently_used": "Frequently used services",
    "freqeuently_used_1": "<a href=\"/vpn#otp\">VPN OTP setup and change request</a>",

    "usage": "Service guides",
    "usage_1": "<a href=\"/vpn#openvpn\">How to connect to VPN</a>",
    "usage_2": "<a href=\"/linux#connect\">How to connect to Linux server</a>",
    "usage_3": "<a href=\"/linux#ssh-key\">How to connect to Linux servers using SSH key</a>",

    "vpn.qr_error": "Failed to generate QR code. Please contact admin.",
    "vpn.qr_set": "QR code has been set",
    "vpn.modal_text": "Scan below QR code to register OTP.",

    "vpn_title": "What is VPN?",
    "vpn_content_1": "VPN stands for Virtual Private Network, which refers to a technology that securely transmits data over the Internet. By encrypting data and preventing data leakage during transmission, VPN can enhance security. With VPN, you can securely connect to the",
    "vpn_content_2": "internal Linux servers from outside the network",
    "vpn_content_3": "The following is a list of Linux server IP addresses that can be accessed via VPN:",
    "vpn_content_4": "You can also connect to other servers (e.g., Linux servers operated in research labs) via VPN from outside the network. If you would like to add servers that can be accessed via VPN, please contact the administrator.",
    "vpn_otp_title": "VPN OTP setup",
    "vpn_otp_content_1": "To connect to VPN, you need an OTP (One-Time Password). OTP is a system that generates a new password every time you connect to VPN to enhance security. Follow these steps to set up OTP.",
    "vpn_otp_content_2": "Install OTP app",
    "vpn_otp_content_3": "To set up OTP, you need an OTP app. Any app that supports the standard OTP protocol can be used, and the following apps are available:",
    "vpn_otp_content_4": "Register OTP",
    "vpn_otp_content_5": "After installing the OTP app, you need to register the OTP for VPN connection. To generate OTP, click the button below, scan the QR code that appears in the popup window with the OTP app, and register the OTP.",
    "vpn_otp_content_6-1": "For security reasons, the QR code is displayed only once and will not be displayed again after the window is closed. Run the OTP app first and prepare to scan the QR code.",
    "vpn_otp_content_6-2": "OTP is already registered. To re-register OTP, click the button below to send a request email to the administrator.",
    "vpn_otp_content_7": "Send email to administrator",
    "vpn_openvpn_title": "OpenVPN Connect setup",
    "vpn_openvpn_content_1": "To connect to VPN, you need OpenVPN Connect. OpenVPN Connect is a VPN client app that can be used on various platforms such as Windows, MacOS, Android, iOS, and ChromeOS. The OpenVPN Connect app can be downloaded from the following link:",
    "vpn_openvpn_content_2": "Download OpenVPN Connect",
    "vpn_openvpn_content_3": "After downloading and installing OpenVPN Connect, you need a VPN configuration file. Click the button below to download and run the VPN configuration file, and OpenVPN Connect app will run automatically and the configuration will be added.",
    "vpn_openvpn_content_4": "Download VPN configuration file",
    "vpn_openvpn_content_5": "Complete the setup by entering the following connection information:",
    "vpn_openvpn_content_6": "Username",
    "vpn_openvpn_content_7": "Password",
    "vpn_openvpn_content_8": "If you frequently connect to VPN, it may be convenient to save your password.",
    "vpn_connect_title": "Connect to VPN",
    "vpn_connect_content_1": "Once the VPN setup is complete, run the OpenVPN Connect app and connect to the VPN server. You must enter the 6-digit number generated by the OTP each time you connect.",

    "linux_title": "Linux server",
    "linux_content_1": "You can use various services such as SSH connection through the Linux server.",
    "linux_content_2": "The following is a list of Linux servers currently in operation:",
    "linux_server_name": "Server name",
    "linux_server_ip": "IP",
    "linux_server_port": "SSH port",
    "linux_server_none": "No accessible servers.",
    "linux_content_3": "The servers can be accessed via SSH within the network, and can be accessed via SSH after connecting to VPN from outside the network. All user data is stored on a central NAS, so you can use the same user environment on all servers.",
    "linux_connect_title": "How to connect to Linux server",
    "linux_connect_intro": "You can connect to the Linux server via a terminal (SSH) or Visual Studio Code.",
    "linux_connect_content_5": "How to connect via SSH",
    "linux_connect_content_6": "Open a terminal: Windows Terminal on Windows, Terminal on macOS, or a terminal emulator on Linux.",
    "linux_connect_content_7": "Enter the following command:",
    "linux_connect_content_8": "ssh ID@server_IP_to_connect -p port_number",
    "linux_connect_content_9": "When a message asking about the server's trustworthiness appears for the first time, enter 'yes'.",
    "linux_connect_content_10": "Enter the password to complete the connection.",
    "linux_connect_content_11": "How to connect using Visual Studio Code",
    "linux_connect_content_12": "Run Visual Studio Code.",
    "linux_connect_content_13": "Click the Extensions icon on the left sidebar, search for the <code>Remote - SSH</code> extension, and install it.",
    "linux_connect_content_14": "Click the <code>><</code> icon at the bottom left of the VSCode window (see below).",
    "linux_connect_content_15": "Click <code>Connect to Host...</code>.",
    "linux_connect_content_16": "Click <code>+ Add New SSH Host...</code>, and enter the following:",
    "linux_connect_content_17": "Press Enter again to add the server to your default SSH settings.",
    "linux_connect_content_18": "Click <code>Connect to Host...</code> again.",
    "linux_connect_content_19": "Click the added server IP to connect.",
    "linux_connect_content_20": "When prompted to select an operating system, select 'Linux'.",
    "linux_connect_content_21": "Enter the password to complete the connection.",
    "linux_ssh-key_title": "How to connect to Linux servers using SSH key",
    "linux_ssh-key_content_1": "User computers are vulnerable to hacking, especially when passwords are frequently leaked during the process of entering passwords. Using SSH key authentication to connect to Linux servers allows you to connect without entering a password, making it more convenient and secure. We recommend following the steps below to set up SSH key authentication.",
    "linux_ssh-key_content_2": "Generate SSH key",
    "linux_ssh-key_content_3": "Open PowerShell on Windows, or Terminal on macOS or Linux.",
    "linux_ssh-key_content_4": "Enter the following command to generate an SSH key:",
    "linux_ssh-key_content_5": "Answer all questions with <code>Enter</code> to generate an SSH key. This will create a <code>.ssh</code> directory under your home directory (e.g., <code>/home/username</code> for Linux, <code>C:\\Users\\username</code> for Windows, <code>/Users/username</code> for macOS), and the following two files will be created inside it.",
    "linux_ssh-key_content_6": "Private key file",
    "linux_ssh-key_content_7": "Public key file",
    "linux_ssh-key_content_8": "The generated private key file (<code>id_rsa</code> file) should never be shared with others and should be stored securely.",
    "linux_ssh-key_content_9": "Copy the public key to the server",
    "linux_ssh-key_content_10": "Open the generated public key file <code>id_rsa.pub</code> with a text editor such as Visual Studio Code and copy the contents.",
    "linux_ssh-key_content_11": "Connect to the Linux server and add the copied public key to the <code>authorized_keys</code> file in the <code>.ssh</code> directory under the home directory. If the <code>.ssh</code> directory and <code>authorized_keys</code> file do not exist, create them.",
    "linux_ssh-key_content_12": "Now, try connecting to the server. You will be able to connect without entering a password.",
    "linux_ssh-key_content_13": "Using SSH key authentication allows you to connect to Linux servers without entering a password. SSH key authentication increases security and is convenient because you do not have to enter a password every time.",

    "password_change": "Change Password",
    "password_change_description": "Change the password used for Linux server and VPN access.",
    "old_password": "Current Password",
    "new_password": "New Password",
    "new_password_confirm": "Confirm New Password",
    "password_changed_success": "Password has been changed successfully.",
    "change_password": "Change Password",
    "changing_password": "Changing..."
}
